Show / Hide Table of Contents
Class PointResults
Point results
Inheritance
System.Object
PointResults
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class PointResults
Constructors
Improve this Doc   View Source
PointResults()
Constructor
Declaration
public PointResults()
Properties
Improve this Doc   View Source
Point
Point
Declaration
public Point2D Point { get; set; }
Property Value
 Type |  Description
 Point2D
Improve this Doc   View Source
Results
List of results in the point
Declaration
public List<PointResultBase> Results { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PointResultBase>
 Improve this Doc
 View Source